ZXY9797/rtos_sdk/embedded/drivers/clock_control/st,stm32h7_clock.c
	return 0;
}

static DEVICE_API(clock_control, stm32_clock_control_api) = {
	.on = stm32_clock_control_on,
	.off = stm32_clock_control_off,
	.get_rate = stm32_clock_control_get_subsys_rate,
	.configure = stm32_clock_control_configure,
};

__unused
static void set_up_fixed_clock_sources(void)
{
#if IS_ENABLED(STM32_HSE_ENABLED)
	/* Enable HSE oscillator */
	if (IS_ENABLED(STM32_HSE_BYPASS)) {
		LL_RCC_HSE_EnableBypass();
	} else {
		LL_RCC_HSE_DisableBypass();
	}

	LL_RCC_HSE_Enable();
	while (LL_RCC_HSE_IsReady() != 1) {
	}
	/* Check if we need to enable HSE clock security system or not */
#if STM32_HSE_CSS
	z_arm_nmi_set_handler(HAL_RCC_NMI_IRQHandler);
	LL_RCC_HSE_EnableCSS();
#endif /* STM32_HSE_CSS */
#endif /* IS_ENABLED(STM32_HSE_ENABLED) */

#if IS_ENABLED(STM32_HSI_ENABLED)
	if (IS_ENABLED(STM32_PLL_SRC_HSI) || IS_ENABLED(STM32_PLL2_SRC_HSI) ||
		IS_ENABLED(STM32_PLL3_SRC_HSI)) {
		/* HSI calibration */
		LL_RCC_HSI_SetCalibTrimming(RCC_HSICALIBRATION_DEFAULT);
	}
	/* Enable HSI if not enabled */
	if (LL_RCC_HSI_IsReady() != 1) {
		/* Enable HSI oscillator */
		LL_RCC_HSI_Enable();
		while (LL_RCC_HSI_IsReady() != 1) {
		/* Wait for HSI ready */
		}
	}
	/* HSI divider configuration */
	LL_RCC_HSI_SetDivider(hsi_divider(STM32_HSI_DIVISOR));
#endif /* IS_ENABLED(STM32_HSI_ENABLED) */

#if IS_ENABLED(STM32_CSI_ENABLED)
	/* Enable CSI oscillator */
	LL_RCC_CSI_Enable();
	while (LL_RCC_CSI_IsReady() != 1) {
	}
#endif /* IS_ENABLED(STM32_CSI_ENABLED) */

#if IS_ENABLED(STM32_LSI_ENABLED)
	/* Enable LSI oscillator */
	LL_RCC_LSI_Enable();
	while (LL_RCC_LSI_IsReady() != 1) {
	}
#endif /* IS_ENABLED(STM32_LSI_ENABLED) */

#if IS_ENABLED(STM32_LSE_ENABLED)
	stm32_backup_domain_enable_access();

	/* Configure driving capability */
	LL_RCC_LSE_SetDriveCapability(STM32_LSE_DRIVING << RCC_BDCR_LSEDRV_Pos);

	if (IS_ENABLED(STM32_LSE_BYPASS)) {
		/* Configure LSE bypass */
		LL_RCC_LSE_EnableBypass();
	}

	/* Enable LSE oscillator */
	LL_RCC_LSE_Enable();
	while (LL_RCC_LSE_IsReady() != 1) {
	}

	stm32_backup_domain_disable_access();
#endif /* IS_ENABLED(STM32_LSE_ENABLED) */

#if IS_ENABLED(STM32_HSI48_ENABLED)
	LL_RCC_HSI48_Enable();
	while (LL_RCC_HSI48_IsReady() != 1) {
	}
#endif /* IS_ENABLED(STM32_HSI48_ENABLED) */
}

/*
 * Unconditionally switch the system clock source to HSI.
 */
__unused
static void stm32_clock_switch_to_hsi(void)
{
	/* Enable HSI if not enabled */
	if (LL_RCC_HSI_IsReady() != 1) {
		/* Enable HSI */
		LL_RCC_HSI_Enable();
		while (LL_RCC_HSI_IsReady() != 1) {
			/* Wait for HSI ready */
		}
	}

	/* Set HSI as SYSCLCK source */
	LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSI);
	while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSI) {
	}
}

__unused
static int set_up_plls(void)
{
#if defined(STM32_PLL_ENABLED) || defined(STM32_PLL2_ENABLED) || defined(STM32_PLL3_ENABLED)
	int r;
	uint32_t vco_input_range;
	uint32_t vco_output_range;

	/*
	 * Case of chain-loaded applications:
	 * Switch to HSI and disable the PLL before configuration.
	 * (Switching to HSI makes sure we have a SYSCLK source in
	 * case we're currently running from the PLL we're about to
	 * turn off and reconfigure.)
	 *
	 */
	if (LL_RCC_GetSysClkSource() == LL_RCC_SYS_CLKSOURCE_STATUS_PLL1) {
		stm32_clock_switch_to_hsi();
		LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);
	}

#if defined(CONFIG_STM32_MEMMAP) && defined(CONFIG_BOOTLOADER_MCUBOOT)
	/*
	 * Don't disable PLL during application initialization
	 * that runs in memmap mode when (Q/O)SPI uses PLL
	 * as its clock source.
	 */
#if defined(OCTOSPI1) || defined(OCTOSPI2)
	if (LL_RCC_GetOSPIClockSource(LL_RCC_OSPI_CLKSOURCE) != LL_RCC_OSPI_CLKSOURCE_PLL1Q) {
		LL_RCC_PLL1_Disable();
	}
	if (LL_RCC_GetOSPIClockSource(LL_RCC_OSPI_CLKSOURCE) != LL_RCC_OSPI_CLKSOURCE_PLL2R) {
		LL_RCC_PLL2_Disable();
	}
#elif defined(QUADSPI)
	if (LL_RCC_GetQSPIClockSource(LL_RCC_QSPI_CLKSOURCE) != LL_RCC_QSPI_CLKSOURCE_PLL1Q) {
		LL_RCC_PLL1_Disable();
	}
	if (LL_RCC_GetQSPIClockSource(LL_RCC_QSPI_CLKSOURCE) != LL_RCC_QSPI_CLKSOURCE_PLL2R) {
		LL_RCC_PLL2_Disable();
	}
#else
	LL_RCC_PLL1_Disable();
	LL_RCC_PLL2_Disable();
#endif
#else
	LL_RCC_PLL1_Disable();
	LL_RCC_PLL2_Disable();
#endif
	LL_RCC_PLL3_Disable();

	/* Configure PLL source */

	/* Can be HSE , HSI 64Mhz/HSIDIV, CSI 4MHz*/
	if (IS_ENABLED(STM32_PLL_SRC_HSE) ||
		IS_ENABLED(STM32_PLL2_SRC_HSE) ||
		IS_ENABLED(STM32_PLL3_SRC_HSE)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL_SetSource(LL_RCC_PLLSOURCE_HSE);
	} else if (IS_ENABLED(STM32_PLL_SRC_CSI) ||
		IS_ENABLED(STM32_PLL2_SRC_CSI) ||
		IS_ENABLED(STM32_PLL3_SRC_CSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL_SetSource(LL_RCC_PLLSOURCE_CSI);
	} else if (IS_ENABLED(STM32_PLL_SRC_HSI) ||
		IS_ENABLED(STM32_PLL2_SRC_HSI) ||
		IS_ENABLED(STM32_PLL3_SRC_HSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL_SetSource(LL_RCC_PLLSOURCE_HSI);
	} else {
		// return -ENOTSUP;
		return -1;
	}

#if defined(STM32_PLL_ENABLED)
	r = get_vco_input_range(STM32_PLL_M_DIVISOR, &vco_input_range);
	if (r < 0) {
		return r;
	}

	vco_output_range = get_vco_output_range(vco_input_range);

	LL_RCC_PLL1_SetM(STM32_PLL_M_DIVISOR);

	LL_RCC_PLL1_SetVCOInputRange(vco_input_range);
	LL_RCC_PLL1_SetVCOOutputRange(vco_output_range);

	LL_RCC_PLL1_SetN(STM32_PLL_N_MULTIPLIER);

	LL_RCC_PLL1FRACN_Disable();
	if (IS_ENABLED(STM32_PLL_FRACN_ENABLED)) {
		LL_RCC_PLL1_SetFRACN(STM32_PLL_FRACN_VALUE);
		LL_RCC_PLL1FRACN_Enable();
	}

	if (IS_ENABLED(STM32_PLL_P_ENABLED)) {
		LL_RCC_PLL1_SetP(STM32_PLL_P_DIVISOR);
		LL_RCC_PLL1P_Enable();
	}

	if (IS_ENABLED(STM32_PLL_Q_ENABLED)) {
		LL_RCC_PLL1_SetQ(STM32_PLL_Q_DIVISOR);
		LL_RCC_PLL1Q_Enable();
	}

	if (IS_ENABLED(STM32_PLL_R_ENABLED)) {
		LL_RCC_PLL1_SetR(STM32_PLL_R_DIVISOR);
		LL_RCC_PLL1R_Enable();
	}

#if defined(CONFIG_SOC_SERIES_STM32H7RSX)
	if (IS_ENABLED(STM32_PLL_S_ENABLED)) {
		LL_RCC_PLL1_SetS(STM32_PLL_S_DIVISOR);
		LL_RCC_PLL1S_Enable();
	}
#endif /* CONFIG_SOC_SERIES_STM32H7RSX */
	LL_RCC_PLL1_Enable();
	while (LL_RCC_PLL1_IsReady() != 1U) {
	}

